qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/pwm.h
/**
 * Copyright (c) 2021 Raspberry Pi (Trading) Ltd.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
// =============================================================================
// Register block : PWM
// Version        : 1
// Bus type       : apb
// Description    : Simple PWM
// =============================================================================
#ifndef HARDWARE_REGS_PWM_DEFINED
#define HARDWARE_REGS_PWM_DEFINED
// =============================================================================
// Register    : PWM_CH0_CSR
// Description : Control and status register
#define PWM_CH0_CSR_OFFSET _u(0x00000000)
#define PWM_CH0_CSR_BITS   _u(0x000000ff)
#define PWM_CH0_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH0_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH0_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH0_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH0_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH0_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH0_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH0_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH0_CSR_PH_RET_MSB    _u(6)
#define PWM_CH0_CSR_PH_RET_LSB    _u(6)
#define PWM_CH0_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH0_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH0_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH0_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH0_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH0_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH0_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH0_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH0_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH0_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_B_INV
// Description : Invert output B
#define PWM_CH0_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH0_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH0_CSR_B_INV_MSB    _u(3)
#define PWM_CH0_CSR_B_INV_LSB    _u(3)
#define PWM_CH0_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_A_INV
// Description : Invert output A
#define PWM_CH0_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH0_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH0_CSR_A_INV_MSB    _u(2)
#define PWM_CH0_CSR_A_INV_LSB    _u(2)
#define PWM_CH0_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH0_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH0_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH0_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH0_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH0_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH0_CSR_EN_RESET  _u(0x0)
#define PWM_CH0_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH0_CSR_EN_MSB    _u(0)
#define PWM_CH0_CSR_EN_LSB    _u(0)
#define PWM_CH0_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH0_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH0_DIV_OFFSET _u(0x00000004)
#define PWM_CH0_DIV_BITS   _u(0x00000fff)
#define PWM_CH0_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_DIV_INT
// Description : None
#define PWM_CH0_DIV_INT_RESET  _u(0x01)
#define PWM_CH0_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH0_DIV_INT_MSB    _u(11)
#define PWM_CH0_DIV_INT_LSB    _u(4)
#define PWM_CH0_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_DIV_FRAC
// Description : None
#define PWM_CH0_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH0_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH0_DIV_FRAC_MSB    _u(3)
#define PWM_CH0_DIV_FRAC_LSB    _u(0)
#define PWM_CH0_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH0_CTR
// Description : Direct access to the PWM counter
#define PWM_CH0_CTR_OFFSET _u(0x00000008)
#define PWM_CH0_CTR_BITS   _u(0x0000ffff)
#define PWM_CH0_CTR_RESET  _u(0x00000000)
#define PWM_CH0_CTR_MSB    _u(15)
#define PWM_CH0_CTR_LSB    _u(0)
#define PWM_CH0_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH0_CC
// Description : Counter compare values
#define PWM_CH0_CC_OFFSET _u(0x0000000c)
#define PWM_CH0_CC_BITS   _u(0xffffffff)
#define PWM_CH0_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CC_B
// Description : None
#define PWM_CH0_CC_B_RESET  _u(0x0000)
#define PWM_CH0_CC_B_BITS   _u(0xffff0000)
#define PWM_CH0_CC_B_MSB    _u(31)
#define PWM_CH0_CC_B_LSB    _u(16)
#define PWM_CH0_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH0_CC_A
// Description : None
#define PWM_CH0_CC_A_RESET  _u(0x0000)
#define PWM_CH0_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH0_CC_A_MSB    _u(15)
#define PWM_CH0_CC_A_LSB    _u(0)
#define PWM_CH0_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH0_TOP
// Description : Counter wrap value
#define PWM_CH0_TOP_OFFSET _u(0x00000010)
#define PWM_CH0_TOP_BITS   _u(0x0000ffff)
#define PWM_CH0_TOP_RESET  _u(0x0000ffff)
#define PWM_CH0_TOP_MSB    _u(15)
#define PWM_CH0_TOP_LSB    _u(0)
#define PWM_CH0_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH1_CSR
// Description : Control and status register
#define PWM_CH1_CSR_OFFSET _u(0x00000014)
#define PWM_CH1_CSR_BITS   _u(0x000000ff)
#define PWM_CH1_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH1_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH1_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH1_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH1_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH1_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH1_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH1_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH1_CSR_PH_RET_MSB    _u(6)
#define PWM_CH1_CSR_PH_RET_LSB    _u(6)
#define PWM_CH1_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH1_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH1_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH1_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH1_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH1_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH1_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH1_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH1_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH1_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_B_INV
// Description : Invert output B
#define PWM_CH1_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH1_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH1_CSR_B_INV_MSB    _u(3)
#define PWM_CH1_CSR_B_INV_LSB    _u(3)
#define PWM_CH1_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_A_INV
// Description : Invert output A
#define PWM_CH1_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH1_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH1_CSR_A_INV_MSB    _u(2)
#define PWM_CH1_CSR_A_INV_LSB    _u(2)
#define PWM_CH1_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH1_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH1_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH1_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH1_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH1_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH1_CSR_EN_RESET  _u(0x0)
#define PWM_CH1_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH1_CSR_EN_MSB    _u(0)
#define PWM_CH1_CSR_EN_LSB    _u(0)
#define PWM_CH1_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH1_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH1_DIV_OFFSET _u(0x00000018)
#define PWM_CH1_DIV_BITS   _u(0x00000fff)
#define PWM_CH1_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_DIV_INT
// Description : None
#define PWM_CH1_DIV_INT_RESET  _u(0x01)
#define PWM_CH1_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH1_DIV_INT_MSB    _u(11)
#define PWM_CH1_DIV_INT_LSB    _u(4)
#define PWM_CH1_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_DIV_FRAC
// Description : None
#define PWM_CH1_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH1_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH1_DIV_FRAC_MSB    _u(3)
#define PWM_CH1_DIV_FRAC_LSB    _u(0)
#define PWM_CH1_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH1_CTR
// Description : Direct access to the PWM counter
#define PWM_CH1_CTR_OFFSET _u(0x0000001c)
#define PWM_CH1_CTR_BITS   _u(0x0000ffff)
#define PWM_CH1_CTR_RESET  _u(0x00000000)
#define PWM_CH1_CTR_MSB    _u(15)
#define PWM_CH1_CTR_LSB    _u(0)
#define PWM_CH1_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH1_CC
// Description : Counter compare values
#define PWM_CH1_CC_OFFSET _u(0x00000020)
#define PWM_CH1_CC_BITS   _u(0xffffffff)
#define PWM_CH1_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CC_B
// Description : None
#define PWM_CH1_CC_B_RESET  _u(0x0000)
#define PWM_CH1_CC_B_BITS   _u(0xffff0000)
#define PWM_CH1_CC_B_MSB    _u(31)
#define PWM_CH1_CC_B_LSB    _u(16)
#define PWM_CH1_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH1_CC_A
// Description : None
#define PWM_CH1_CC_A_RESET  _u(0x0000)
#define PWM_CH1_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH1_CC_A_MSB    _u(15)
#define PWM_CH1_CC_A_LSB    _u(0)
#define PWM_CH1_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH1_TOP
// Description : Counter wrap value
#define PWM_CH1_TOP_OFFSET _u(0x00000024)
#define PWM_CH1_TOP_BITS   _u(0x0000ffff)
#define PWM_CH1_TOP_RESET  _u(0x0000ffff)
#define PWM_CH1_TOP_MSB    _u(15)
#define PWM_CH1_TOP_LSB    _u(0)
#define PWM_CH1_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH2_CSR
// Description : Control and status register
#define PWM_CH2_CSR_OFFSET _u(0x00000028)
#define PWM_CH2_CSR_BITS   _u(0x000000ff)
#define PWM_CH2_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH2_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH2_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH2_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH2_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH2_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH2_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH2_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH2_CSR_PH_RET_MSB    _u(6)
#define PWM_CH2_CSR_PH_RET_LSB    _u(6)
#define PWM_CH2_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH2_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH2_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH2_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH2_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH2_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH2_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH2_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH2_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH2_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_B_INV
// Description : Invert output B
#define PWM_CH2_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH2_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH2_CSR_B_INV_MSB    _u(3)
#define PWM_CH2_CSR_B_INV_LSB    _u(3)
#define PWM_CH2_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_A_INV
// Description : Invert output A
#define PWM_CH2_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH2_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH2_CSR_A_INV_MSB    _u(2)
#define PWM_CH2_CSR_A_INV_LSB    _u(2)
#define PWM_CH2_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH2_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH2_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH2_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH2_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH2_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH2_CSR_EN_RESET  _u(0x0)
#define PWM_CH2_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH2_CSR_EN_MSB    _u(0)
#define PWM_CH2_CSR_EN_LSB    _u(0)
#define PWM_CH2_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH2_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH2_DIV_OFFSET _u(0x0000002c)
#define PWM_CH2_DIV_BITS   _u(0x00000fff)
#define PWM_CH2_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_DIV_INT
// Description : None
#define PWM_CH2_DIV_INT_RESET  _u(0x01)
#define PWM_CH2_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH2_DIV_INT_MSB    _u(11)
#define PWM_CH2_DIV_INT_LSB    _u(4)
#define PWM_CH2_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_DIV_FRAC
// Description : None
#define PWM_CH2_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH2_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH2_DIV_FRAC_MSB    _u(3)
#define PWM_CH2_DIV_FRAC_LSB    _u(0)
#define PWM_CH2_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH2_CTR
// Description : Direct access to the PWM counter
#define PWM_CH2_CTR_OFFSET _u(0x00000030)
#define PWM_CH2_CTR_BITS   _u(0x0000ffff)
#define PWM_CH2_CTR_RESET  _u(0x00000000)
#define PWM_CH2_CTR_MSB    _u(15)
#define PWM_CH2_CTR_LSB    _u(0)
#define PWM_CH2_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH2_CC
// Description : Counter compare values
#define PWM_CH2_CC_OFFSET _u(0x00000034)
#define PWM_CH2_CC_BITS   _u(0xffffffff)
#define PWM_CH2_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CC_B
// Description : None
#define PWM_CH2_CC_B_RESET  _u(0x0000)
#define PWM_CH2_CC_B_BITS   _u(0xffff0000)
#define PWM_CH2_CC_B_MSB    _u(31)
#define PWM_CH2_CC_B_LSB    _u(16)
#define PWM_CH2_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH2_CC_A
// Description : None
#define PWM_CH2_CC_A_RESET  _u(0x0000)
#define PWM_CH2_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH2_CC_A_MSB    _u(15)
#define PWM_CH2_CC_A_LSB    _u(0)
#define PWM_CH2_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH2_TOP
// Description : Counter wrap value
#define PWM_CH2_TOP_OFFSET _u(0x00000038)
#define PWM_CH2_TOP_BITS   _u(0x0000ffff)
#define PWM_CH2_TOP_RESET  _u(0x0000ffff)
#define PWM_CH2_TOP_MSB    _u(15)
#define PWM_CH2_TOP_LSB    _u(0)
#define PWM_CH2_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH3_CSR
// Description : Control and status register
#define PWM_CH3_CSR_OFFSET _u(0x0000003c)
#define PWM_CH3_CSR_BITS   _u(0x000000ff)
#define PWM_CH3_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH3_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH3_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH3_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH3_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH3_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH3_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH3_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH3_CSR_PH_RET_MSB    _u(6)
#define PWM_CH3_CSR_PH_RET_LSB    _u(6)
#define PWM_CH3_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH3_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH3_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH3_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH3_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH3_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH3_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH3_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH3_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH3_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_B_INV
// Description : Invert output B
#define PWM_CH3_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH3_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH3_CSR_B_INV_MSB    _u(3)
#define PWM_CH3_CSR_B_INV_LSB    _u(3)
#define PWM_CH3_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_A_INV
// Description : Invert output A
#define PWM_CH3_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH3_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH3_CSR_A_INV_MSB    _u(2)
#define PWM_CH3_CSR_A_INV_LSB    _u(2)
#define PWM_CH3_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH3_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH3_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH3_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH3_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH3_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH3_CSR_EN_RESET  _u(0x0)
#define PWM_CH3_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH3_CSR_EN_MSB    _u(0)
#define PWM_CH3_CSR_EN_LSB    _u(0)
#define PWM_CH3_CSR_EN_ACCESS "RW"
