qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/pwm.h
// =============================================================================
// Register    : PWM_CH3_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH3_DIV_OFFSET _u(0x00000040)
#define PWM_CH3_DIV_BITS   _u(0x00000fff)
#define PWM_CH3_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_DIV_INT
// Description : None
#define PWM_CH3_DIV_INT_RESET  _u(0x01)
#define PWM_CH3_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH3_DIV_INT_MSB    _u(11)
#define PWM_CH3_DIV_INT_LSB    _u(4)
#define PWM_CH3_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_DIV_FRAC
// Description : None
#define PWM_CH3_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH3_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH3_DIV_FRAC_MSB    _u(3)
#define PWM_CH3_DIV_FRAC_LSB    _u(0)
#define PWM_CH3_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH3_CTR
// Description : Direct access to the PWM counter
#define PWM_CH3_CTR_OFFSET _u(0x00000044)
#define PWM_CH3_CTR_BITS   _u(0x0000ffff)
#define PWM_CH3_CTR_RESET  _u(0x00000000)
#define PWM_CH3_CTR_MSB    _u(15)
#define PWM_CH3_CTR_LSB    _u(0)
#define PWM_CH3_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH3_CC
// Description : Counter compare values
#define PWM_CH3_CC_OFFSET _u(0x00000048)
#define PWM_CH3_CC_BITS   _u(0xffffffff)
#define PWM_CH3_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CC_B
// Description : None
#define PWM_CH3_CC_B_RESET  _u(0x0000)
#define PWM_CH3_CC_B_BITS   _u(0xffff0000)
#define PWM_CH3_CC_B_MSB    _u(31)
#define PWM_CH3_CC_B_LSB    _u(16)
#define PWM_CH3_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH3_CC_A
// Description : None
#define PWM_CH3_CC_A_RESET  _u(0x0000)
#define PWM_CH3_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH3_CC_A_MSB    _u(15)
#define PWM_CH3_CC_A_LSB    _u(0)
#define PWM_CH3_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH3_TOP
// Description : Counter wrap value
#define PWM_CH3_TOP_OFFSET _u(0x0000004c)
#define PWM_CH3_TOP_BITS   _u(0x0000ffff)
#define PWM_CH3_TOP_RESET  _u(0x0000ffff)
#define PWM_CH3_TOP_MSB    _u(15)
#define PWM_CH3_TOP_LSB    _u(0)
#define PWM_CH3_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH4_CSR
// Description : Control and status register
#define PWM_CH4_CSR_OFFSET _u(0x00000050)
#define PWM_CH4_CSR_BITS   _u(0x000000ff)
#define PWM_CH4_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH4_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH4_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH4_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH4_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH4_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH4_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH4_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH4_CSR_PH_RET_MSB    _u(6)
#define PWM_CH4_CSR_PH_RET_LSB    _u(6)
#define PWM_CH4_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH4_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH4_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH4_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH4_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH4_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH4_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH4_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH4_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH4_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_B_INV
// Description : Invert output B
#define PWM_CH4_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH4_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH4_CSR_B_INV_MSB    _u(3)
#define PWM_CH4_CSR_B_INV_LSB    _u(3)
#define PWM_CH4_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_A_INV
// Description : Invert output A
#define PWM_CH4_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH4_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH4_CSR_A_INV_MSB    _u(2)
#define PWM_CH4_CSR_A_INV_LSB    _u(2)
#define PWM_CH4_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH4_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH4_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH4_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH4_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH4_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH4_CSR_EN_RESET  _u(0x0)
#define PWM_CH4_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH4_CSR_EN_MSB    _u(0)
#define PWM_CH4_CSR_EN_LSB    _u(0)
#define PWM_CH4_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH4_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH4_DIV_OFFSET _u(0x00000054)
#define PWM_CH4_DIV_BITS   _u(0x00000fff)
#define PWM_CH4_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_DIV_INT
// Description : None
#define PWM_CH4_DIV_INT_RESET  _u(0x01)
#define PWM_CH4_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH4_DIV_INT_MSB    _u(11)
#define PWM_CH4_DIV_INT_LSB    _u(4)
#define PWM_CH4_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_DIV_FRAC
// Description : None
#define PWM_CH4_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH4_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH4_DIV_FRAC_MSB    _u(3)
#define PWM_CH4_DIV_FRAC_LSB    _u(0)
#define PWM_CH4_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH4_CTR
// Description : Direct access to the PWM counter
#define PWM_CH4_CTR_OFFSET _u(0x00000058)
#define PWM_CH4_CTR_BITS   _u(0x0000ffff)
#define PWM_CH4_CTR_RESET  _u(0x00000000)
#define PWM_CH4_CTR_MSB    _u(15)
#define PWM_CH4_CTR_LSB    _u(0)
#define PWM_CH4_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH4_CC
// Description : Counter compare values
#define PWM_CH4_CC_OFFSET _u(0x0000005c)
#define PWM_CH4_CC_BITS   _u(0xffffffff)
#define PWM_CH4_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CC_B
// Description : None
#define PWM_CH4_CC_B_RESET  _u(0x0000)
#define PWM_CH4_CC_B_BITS   _u(0xffff0000)
#define PWM_CH4_CC_B_MSB    _u(31)
#define PWM_CH4_CC_B_LSB    _u(16)
#define PWM_CH4_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH4_CC_A
// Description : None
#define PWM_CH4_CC_A_RESET  _u(0x0000)
#define PWM_CH4_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH4_CC_A_MSB    _u(15)
#define PWM_CH4_CC_A_LSB    _u(0)
#define PWM_CH4_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH4_TOP
// Description : Counter wrap value
#define PWM_CH4_TOP_OFFSET _u(0x00000060)
#define PWM_CH4_TOP_BITS   _u(0x0000ffff)
#define PWM_CH4_TOP_RESET  _u(0x0000ffff)
#define PWM_CH4_TOP_MSB    _u(15)
#define PWM_CH4_TOP_LSB    _u(0)
#define PWM_CH4_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH5_CSR
// Description : Control and status register
#define PWM_CH5_CSR_OFFSET _u(0x00000064)
#define PWM_CH5_CSR_BITS   _u(0x000000ff)
#define PWM_CH5_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH5_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH5_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH5_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH5_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH5_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH5_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH5_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH5_CSR_PH_RET_MSB    _u(6)
#define PWM_CH5_CSR_PH_RET_LSB    _u(6)
#define PWM_CH5_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH5_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH5_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH5_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH5_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH5_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH5_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH5_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH5_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH5_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_B_INV
// Description : Invert output B
#define PWM_CH5_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH5_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH5_CSR_B_INV_MSB    _u(3)
#define PWM_CH5_CSR_B_INV_LSB    _u(3)
#define PWM_CH5_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_A_INV
// Description : Invert output A
#define PWM_CH5_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH5_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH5_CSR_A_INV_MSB    _u(2)
#define PWM_CH5_CSR_A_INV_LSB    _u(2)
#define PWM_CH5_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH5_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH5_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH5_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH5_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH5_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH5_CSR_EN_RESET  _u(0x0)
#define PWM_CH5_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH5_CSR_EN_MSB    _u(0)
#define PWM_CH5_CSR_EN_LSB    _u(0)
#define PWM_CH5_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH5_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH5_DIV_OFFSET _u(0x00000068)
#define PWM_CH5_DIV_BITS   _u(0x00000fff)
#define PWM_CH5_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_DIV_INT
// Description : None
#define PWM_CH5_DIV_INT_RESET  _u(0x01)
#define PWM_CH5_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH5_DIV_INT_MSB    _u(11)
#define PWM_CH5_DIV_INT_LSB    _u(4)
#define PWM_CH5_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_DIV_FRAC
// Description : None
#define PWM_CH5_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH5_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH5_DIV_FRAC_MSB    _u(3)
#define PWM_CH5_DIV_FRAC_LSB    _u(0)
#define PWM_CH5_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH5_CTR
// Description : Direct access to the PWM counter
#define PWM_CH5_CTR_OFFSET _u(0x0000006c)
#define PWM_CH5_CTR_BITS   _u(0x0000ffff)
#define PWM_CH5_CTR_RESET  _u(0x00000000)
#define PWM_CH5_CTR_MSB    _u(15)
#define PWM_CH5_CTR_LSB    _u(0)
#define PWM_CH5_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH5_CC
// Description : Counter compare values
#define PWM_CH5_CC_OFFSET _u(0x00000070)
#define PWM_CH5_CC_BITS   _u(0xffffffff)
#define PWM_CH5_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CC_B
// Description : None
#define PWM_CH5_CC_B_RESET  _u(0x0000)
#define PWM_CH5_CC_B_BITS   _u(0xffff0000)
#define PWM_CH5_CC_B_MSB    _u(31)
#define PWM_CH5_CC_B_LSB    _u(16)
#define PWM_CH5_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH5_CC_A
// Description : None
#define PWM_CH5_CC_A_RESET  _u(0x0000)
#define PWM_CH5_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH5_CC_A_MSB    _u(15)
#define PWM_CH5_CC_A_LSB    _u(0)
#define PWM_CH5_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH5_TOP
// Description : Counter wrap value
#define PWM_CH5_TOP_OFFSET _u(0x00000074)
#define PWM_CH5_TOP_BITS   _u(0x0000ffff)
#define PWM_CH5_TOP_RESET  _u(0x0000ffff)
#define PWM_CH5_TOP_MSB    _u(15)
#define PWM_CH5_TOP_LSB    _u(0)
#define PWM_CH5_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH6_CSR
// Description : Control and status register
#define PWM_CH6_CSR_OFFSET _u(0x00000078)
#define PWM_CH6_CSR_BITS   _u(0x000000ff)
#define PWM_CH6_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH6_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH6_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH6_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH6_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH6_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH6_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH6_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH6_CSR_PH_RET_MSB    _u(6)
#define PWM_CH6_CSR_PH_RET_LSB    _u(6)
#define PWM_CH6_CSR_PH_RET_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_DIVMODE
// Description : 0x0 -> Free-running counting at rate dictated by fractional
//               divider
//               0x1 -> Fractional divider operation is gated by the PWM B pin.
//               0x2 -> Counter advances with each rising edge of the PWM B pin.
//               0x3 -> Counter advances with each falling edge of the PWM B
//               pin.
#define PWM_CH6_CSR_DIVMODE_RESET       _u(0x0)
#define PWM_CH6_CSR_DIVMODE_BITS        _u(0x00000030)
#define PWM_CH6_CSR_DIVMODE_MSB         _u(5)
#define PWM_CH6_CSR_DIVMODE_LSB         _u(4)
#define PWM_CH6_CSR_DIVMODE_ACCESS      "RW"
#define PWM_CH6_CSR_DIVMODE_VALUE_DIV   _u(0x0)
#define PWM_CH6_CSR_DIVMODE_VALUE_LEVEL _u(0x1)
#define PWM_CH6_CSR_DIVMODE_VALUE_RISE  _u(0x2)
#define PWM_CH6_CSR_DIVMODE_VALUE_FALL  _u(0x3)
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_B_INV
// Description : Invert output B
#define PWM_CH6_CSR_B_INV_RESET  _u(0x0)
#define PWM_CH6_CSR_B_INV_BITS   _u(0x00000008)
#define PWM_CH6_CSR_B_INV_MSB    _u(3)
#define PWM_CH6_CSR_B_INV_LSB    _u(3)
#define PWM_CH6_CSR_B_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_A_INV
// Description : Invert output A
#define PWM_CH6_CSR_A_INV_RESET  _u(0x0)
#define PWM_CH6_CSR_A_INV_BITS   _u(0x00000004)
#define PWM_CH6_CSR_A_INV_MSB    _u(2)
#define PWM_CH6_CSR_A_INV_LSB    _u(2)
#define PWM_CH6_CSR_A_INV_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_PH_CORRECT
// Description : 1: Enable phase-correct modulation. 0: Trailing-edge
#define PWM_CH6_CSR_PH_CORRECT_RESET  _u(0x0)
#define PWM_CH6_CSR_PH_CORRECT_BITS   _u(0x00000002)
#define PWM_CH6_CSR_PH_CORRECT_MSB    _u(1)
#define PWM_CH6_CSR_PH_CORRECT_LSB    _u(1)
#define PWM_CH6_CSR_PH_CORRECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CSR_EN
// Description : Enable the PWM channel.
#define PWM_CH6_CSR_EN_RESET  _u(0x0)
#define PWM_CH6_CSR_EN_BITS   _u(0x00000001)
#define PWM_CH6_CSR_EN_MSB    _u(0)
#define PWM_CH6_CSR_EN_LSB    _u(0)
#define PWM_CH6_CSR_EN_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH6_DIV
// Description : INT and FRAC form a fixed-point fractional number.
//               Counting rate is system clock frequency divided by this number.
//               Fractional division uses simple 1st-order sigma-delta.
#define PWM_CH6_DIV_OFFSET _u(0x0000007c)
#define PWM_CH6_DIV_BITS   _u(0x00000fff)
#define PWM_CH6_DIV_RESET  _u(0x00000010)
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_DIV_INT
// Description : None
#define PWM_CH6_DIV_INT_RESET  _u(0x01)
#define PWM_CH6_DIV_INT_BITS   _u(0x00000ff0)
#define PWM_CH6_DIV_INT_MSB    _u(11)
#define PWM_CH6_DIV_INT_LSB    _u(4)
#define PWM_CH6_DIV_INT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_DIV_FRAC
// Description : None
#define PWM_CH6_DIV_FRAC_RESET  _u(0x0)
#define PWM_CH6_DIV_FRAC_BITS   _u(0x0000000f)
#define PWM_CH6_DIV_FRAC_MSB    _u(3)
#define PWM_CH6_DIV_FRAC_LSB    _u(0)
#define PWM_CH6_DIV_FRAC_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH6_CTR
// Description : Direct access to the PWM counter
#define PWM_CH6_CTR_OFFSET _u(0x00000080)
#define PWM_CH6_CTR_BITS   _u(0x0000ffff)
#define PWM_CH6_CTR_RESET  _u(0x00000000)
#define PWM_CH6_CTR_MSB    _u(15)
#define PWM_CH6_CTR_LSB    _u(0)
#define PWM_CH6_CTR_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH6_CC
// Description : Counter compare values
#define PWM_CH6_CC_OFFSET _u(0x00000084)
#define PWM_CH6_CC_BITS   _u(0xffffffff)
#define PWM_CH6_CC_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CC_B
// Description : None
#define PWM_CH6_CC_B_RESET  _u(0x0000)
#define PWM_CH6_CC_B_BITS   _u(0xffff0000)
#define PWM_CH6_CC_B_MSB    _u(31)
#define PWM_CH6_CC_B_LSB    _u(16)
#define PWM_CH6_CC_B_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : PWM_CH6_CC_A
// Description : None
#define PWM_CH6_CC_A_RESET  _u(0x0000)
#define PWM_CH6_CC_A_BITS   _u(0x0000ffff)
#define PWM_CH6_CC_A_MSB    _u(15)
#define PWM_CH6_CC_A_LSB    _u(0)
#define PWM_CH6_CC_A_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH6_TOP
// Description : Counter wrap value
#define PWM_CH6_TOP_OFFSET _u(0x00000088)
#define PWM_CH6_TOP_BITS   _u(0x0000ffff)
#define PWM_CH6_TOP_RESET  _u(0x0000ffff)
#define PWM_CH6_TOP_MSB    _u(15)
#define PWM_CH6_TOP_LSB    _u(0)
#define PWM_CH6_TOP_ACCESS "RW"
// =============================================================================
// Register    : PWM_CH7_CSR
// Description : Control and status register
#define PWM_CH7_CSR_OFFSET _u(0x0000008c)
#define PWM_CH7_CSR_BITS   _u(0x000000ff)
#define PWM_CH7_CSR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CSR_PH_ADV
// Description : Advance the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running
//               at less than full speed (div_int + div_frac / 16 > 1)
#define PWM_CH7_CSR_PH_ADV_RESET  _u(0x0)
#define PWM_CH7_CSR_PH_ADV_BITS   _u(0x00000080)
#define PWM_CH7_CSR_PH_ADV_MSB    _u(7)
#define PWM_CH7_CSR_PH_ADV_LSB    _u(7)
#define PWM_CH7_CSR_PH_ADV_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : PWM_CH7_CSR_PH_RET
// Description : Retard the phase of the counter by 1 count, while it is
//               running.
//               Self-clearing. Write a 1, and poll until low. Counter must be
//               running.
#define PWM_CH7_CSR_PH_RET_RESET  _u(0x0)
#define PWM_CH7_CSR_PH_RET_BITS   _u(0x00000040)
#define PWM_CH7_CSR_PH_RET_MSB    _u(6)
#define PWM_CH7_CSR_PH_RET_LSB    _u(6)
#define PWM_CH7_CSR_PH_RET_ACCESS "SC"
